Autodesk.Revit.DB.CustomExporter.IsRenderingSupported
Checks if view rendering is currently supported in the running instance of Revit.
Remarks:
A typical reason for rendering not being enabled is when rendering and material
libraries are not currently available in the installed copy of Revit.
Returns:
Returns True if rendering is currently supported, False otherwise.
Since:
2014 UR1

Autodesk.Revit.DB.CustomExporter.Export(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Exports a collection of 3D or 2D views
Remarks:
Note that the actual export process may differ
depending on the type of export context used. For example, when the
Autodesk.Revit.DB.IModelExportContext is used,
Revit is likely to perform several rounds of traversing each view, which
may result in invoking the OnViewBegin/OnViewEnd method multiple times
for every one view. It is because Revit draws objects in several layers
(model layer, annotation layer, etc.) and will traverse each layer individually.
In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd:
In the first round, all model entities will be received, while in the second round
all text annotation elements will be received, if any present in the given view.
Note that all views in the collection must be either 3D or 2D views and they must match the exporter context.
Note that currently the only 2D view types exported are Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects FloorPlan, CeilingPlan,Elevation, Section, Detail, EngineeringPlan, AreaPlan.
viewIds:
An array of views to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in viewIds is not a valid exportable view.
For example, templates are not considered valid views to export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.Export(Autodesk.Revit.DB.View)
Exports one 3D or 2D view
Remarks:
Note that the actual export process may differ
depending on the type of export context used. For example, when the
Autodesk.Revit.DB.IModelExportContext is used,
Revit is likely to perform several rounds of traversing each view, which
may result in invoking the OnViewBegin/OnViewEnd method multiple times
for every one view. It is because Revit draws objects in several layers
(model layer, annotation layer, etc.) and will traverse each layer individually.
In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd:
In the first round, all model entities will be received, while in the second round
all text annotation elements will be received, if any present in the given view.
view:
An instance of the view to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
The view is not exportable, such as a template view or wrong type view, for example.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.Export2DForceDisplayStyle
This value tells the exporter of 2D views to force the given display mode for the view.
Remarks:
Only DisplayStyle::Wireframe and DisplayStyle::HLR values are supported.
Default forced value is DisplayStyle::HLR unless the view has DisplayStyle:Wireframe.
See notes for 2D export for views in non-Wireframe display style in Autodesk::Revit::DB::IExportContextBase and Autodesk.Revit.DB.IExportContext2D.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.CustomExporter.Export2DIncludingAnnotationObjects
This flag sets the exporter of 2D views to either include or exclude
output of annotation objects
when the model is being processed by the export context.
Remarks:
A convenient way of determining whether an element category is annotation is using Autodesk::Revit::DB::Category::CategoryType.
Since:
2020

Autodesk.Revit.DB.CustomExporter.Export2DGeometricObjectsIncludingPatternLines
This flag sets the exporter of 2D views to either include or exclude
output of face pattern lines as part of geometric objects
when the model is being processed by the export context.
Remarks:
This flag is ignored if view has Wireframe display style.
This flag is ignored unless property "IncludeGeometricObjects" is set to true.
Since:
2020

Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects
This flag sets the exporter to either include or exclude
output of geometric objects such as faces and curves
when the model is being processed by the export context.
Remarks:
If geometric objects are to be excluded, the context will not
receive any of the calls to related to Faces or Curves. However, the
objects will be still processed by Revit resulting in exporting their
tessellated geometry in form of polymeshes or lines, respectivelly.
Regardless of the value of this property, the export context
must always implement the methods related to receiving of geometric
objects (e.g. OnFaceStart, OnFaceEnd, OnCurve, etc.), even though
the methods may never be invoked.
Setting this property to False allows clients to significantly speed up
the export process. If the export context does not need to examine geometric
objects, it is recommended setting this property to False, which will make
the export process faster even when compared with export during which
notifications about geometric objects are sent, but ignored by the context.
Since:
2014

Autodesk.Revit.DB.CustomExporter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IExportContext)
Constructs a new instance of a CustomExporter for a given document
using the input instance of IExportContext as the output device.
Remarks:
The input context should be an instance of a class that implements
either Autodesk.Revit.DB.IModelExportContext
or Autodesk.Revit.DB.IPhotoRenderContext interfaces.
document:
The document containing the model to be exported
context:
An instance of a context class that will be consuming the output
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.CustomExporter
A class that allows exporting 3D or 2D views via an export context.
Remarks:
The Export method of this class triggers standard rendering or exporting
process in Revit, but instead of displaying the result on screen or printer,
the output is channeled through the given custom context that handles
processing of the geometric as well as non-geometric information.
Revit will process the exporting algorithm depending on the type
of given context. If an instance of Autodesk.Revit.DB.IPhotoRenderContext
is used, then Revit will output the model as if executing the Render command,
thus only such entities that would be visible in a rendered view
will be sent to the context.
Alternatively, if an instance of Autodesk.Revit.DB.IModelExportContext
is used, Revit will output the model as if exporting it to a CAD format,
a process which results outputting also objects that would not
appear in a rendered image, such as model curves and text annotations.
For 2D views, an instance of Autodesk.Revit.DB.IExportContext2D
has to be used. Revit will output the contents of the 2D view as it is displayed on the screen.
Export can be modified by setting properties pertaining to 2D views:
Autodesk.Revit.DB.CustomExporter.Export2DGeometricObjectsIncludingPatternLines,
Autodesk.Revit.DB.CustomExporter.Export2DIncludingAnnotationObjects.
Autodesk.Revit.DB.CustomExporter.Export2DForceDisplayStyle.
See notes for 2D export in Autodesk.Revit.DB.IExportContext2D.
Since:
2014